wsig/examples/xml/MathService-testGetComp.xml

<?xml version="1.0" encoding="UTF-8" ?> 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:q0="http://www.w3.org/2000/10/XMLSchema" xmlns:q1="urn:MathService" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q1:getcomponents soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<complex xsi:type="q1:complex">
				<real xsi:type="q0:float">5</real> 
				<immaginary xsi:type="q0:float">6</immaginary> 
			</complex>
		</q1:getcomponents>
	</soapenv:Body>
</soapenv:Envelope>